app/controllers/thoughts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 20]]
---
  def show
    posts = Post.all.order('created_at DESC').limit(20)