app/controllers/token_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def refresh_token
    client = Client.find_by(id: params[:client_id])